app/views/questions/_answer_inline.html.erb

SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = $1  [["question_id", 2]]
---
<% question.answers.each do |ans| %>