app/controllers/answers_controller.rb

  def index
    @question = Question.find(params[:question_id])
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def show
    @answer = Answer.find(params[:id])
---
SELECT "answers".* FROM "answers" WHERE "answers"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def new
    @question = Question.find(params[:question_id])
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def edit
    @answer = Answer.find(params[:id])
---
SELECT "answers".* FROM "answers" WHERE "answers"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    @question = Question.find(params[:question_id])
    @answer = @question.answers.new(answer_params)

    respond_to do |format|
      if @answer.save
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "answers" ("body", "question_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "asdasd"], ["question_id", 1], ["created_at", "2022-10-09 22:53:05.274335"], ["updated_at", "2022-10-09 22:53:05.274335"]]

  def update
    @question = Question.find(params[:question_id])
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def destroy
    @question = Question.find(params[:question_id])
    @answer = Answer.find(params[:id])

    if !@answer.comments.empty?
      redirect = question_url(@question)
      notice = "First delete all the comments"
    elsif @answer.destroy
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "answers".* FROM "answers" WHERE "answers"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "answers".* FROM "answers" WHERE "answers"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT 1 AS one FROM "comments" WHERE "comments"."answer_id" = $1 LIMIT $2  [["answer_id", 5], ["LIMIT", 1]]
DELETE FROM "answers" WHERE "answers"."id" = $1  [["id", 5]]