app/controllers/questions_controller.rb

  def create
    @question = Question.new(question_params)

    respond_to do |format|
      if @question.save
---
INSERT INTO "questions" ("question", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["question", "When is lunch"], ["body", "12:00"], ["created_at", "2022-11-01 13:51:48.549250"], ["updated_at", "2022-11-01 13:51:48.549250"]]

  def update
    respond_to do |format|
      if @question.update(question_params)
---
UPDATE "questions" SET "question" = $1, "updated_at" = $2 WHERE "questions"."id" = $3  [["question", "Excel to CSV with UTF8 encoding"], ["updated_at", "2022-10-09 20:42:34.495609"], ["id", 1]]

  def destroy
    respond_to do |format|
      if !@question.answers.empty?
        format.html { redirect_to questions_url, notice: "First delete all the answers" }
      elsif @question.destroy!
---
SELECT 1 AS one FROM "answers" WHERE "answers"."question_id" = $1 LIMIT $2  [["question_id", 1], ["LIMIT", 1]]
DELETE FROM "questions" WHERE "questions"."id" = $1  [["id", 1]]